了　イベントの詳細ページに申し込み者一覧を表示する
了　イベントに申し込み上限を設定する　# eventに申し込み上限カラムを実装して、それ以上の場合申し込みボタンが表示されないようにする
了　キャンセルとキャンセルリクエストを分けユーザからはキャンセルリクエストをさせるようにする
了　申し込みとキャンセルリクエスト、キャンセルでユーザに確認メールが送信されるようにする
了　カレンダーに土日祝を表示する
了　新規登録ページと会員専用ページを分ける
了　募集期間を過ぎたイベントの申し込みを停止する
了　ユーザー情報に顔写真を登録できるようにする
了　出勤確認機能 
了　給与明細機能
了　検索機能
了　ソート機能

途　勤怠管理機能 # 退勤時間カラム(中間) - 出勤時間カラム(中間)　x 時給カラム(イベント) => 給与カラム(中間)　
　　　　　　　　 # model,controller側ではaccepts_nested_attributes_for view側ではfields_for
　　通知機能を追加
　　同意者への定期メール送信
　　アカウント編集機能
　　データをAWSで管理する
　　アプリ全体の見た目を整える
　　アプリを公開する

JavaScript
　　イベントの絞り込み機能
　　イベントをアイコンで表示する


