了　イベントの詳細ページに申し込み者一覧を表示する
了　イベントに申し込み上限を設定する # eventに申し込み上限カラムを実装して、それ以上の場合申し込みボタンが表示されないようにする
了　キャンセルとキャンセルリクエストを分けユーザからはキャンセルリクエストをさせるようにする
了　申し込みとキャンセルリクエスト、キャンセルでユーザに確認メールが送信されるようにする
了　カレンダーに土日祝を表示する
了　新規登録ページと会員専用ページを分ける
了　募集期間を過ぎたイベントの申し込みを停止する
了　ユーザー情報に顔写真を登録できるようにする
了　出勤確認機能 
了　給与明細機能
了　検索機能
了　ソート機能
了　勤怠管理機能 # model,controller側ではaccepts_nested_attributes_for view側ではfields_for
了　アカウント編集機能
了　申し込み一覧画面と案件管理画面で月ごとに表示するように変更
了　パスワード再設定機能
了　アプリ全体の見た目を整える
了　エラー画面を設定する
了　データをAWSで管理する
　　アプリを公開する
　　リファクタリング

JavaScript
　　Ajaxで削除機能
　　イベントの絞り込み機能
　　イベントをアイコンで表示する


